module Constants
  HANDICAPEDIES = [
      ["上肢", "上肢"],
      ["下肢", "下肢"],
      ["上下肢", "上下肢"],
      ["体幹", "体幹"],
      ["視覚", "視覚"],
      ["聴覚", "聴覚"],
      ["言語/そしゃく", "言語/そしゃく"],
      ["心臓", "心臓"],
      ["腎臓", "腎臓"],
      ["ぼうこうもしくは直腸", "ぼうこうもしくは直腸"],
      ["小腸", "小腸"],
      ["肝臓", "肝臓"],
      ["呼吸器", "呼吸器"],
      ["免疫不全", "免疫不全"],
      ["身体障がいその他", "身体障がいその他"],
      ["てんかん", "てんかん"],
      ["うつ"],
      ["躁うつ（双極生）", "躁うつ（双極生）"],
      ["統合失調症", "統合失調症"],
      ["神経症・不安障がい", "神経症・不安障がい"],
      ["適応障がい", "適応障がい"],
      ["精神障がいその他", "精神障がいその他"],
      ["高機能自閉症・アスペルガー症候群", "高機能自閉症・アスペルガー症候群"],
      ["注意欠陥/多動性障がい(ADHD)", "注意欠陥/多動性障がい(ADHD)"],
      ["学習障がい(LD)", "学習障がい(LD)"],
      ["その他の発達障がい", "その他の発達障がい"],
      ["人格障がい", "人格障がい"],
      ["解離性障がい", "解離性障がい"],
      ["知的", " 知的"]
  ]
  HANDICAPED_LEVELS = [
      ["1級", "1級"],
      ["2級", "2級"],
      ["3級", "3級"],
      ["4級", "4級"],
      ["5級", "5級"],
      ["6級", "6級"],
      ["7級", "7級"],
      ["A", "A"],
      ["B", "B"],
      ["C", "C"],
      ["取得予定", "取得予定"]
  ]
  SEARCH_AREAS = [
      '北海道', '青森県', '岩手県', '宮城県', '秋田県',
      '山形県', '福島県', '茨城県', '栃木県', '群馬県',
      '埼玉県', '千葉県', '東京都', '神奈川県', '新潟県',
      '富山県', '石川県', '福井県', '山梨県', '長野県',
      '岐阜県', '静岡県', '愛知県', '三重県', '滋賀県',
      '京都府', '大阪府', '兵庫県', '奈良県', '和歌山県',
      '鳥取県', '島根県', '岡山県', '広島県', '山口県',
      '徳島県', '香川県', '愛媛県', '高知県', '福岡県',
      '佐賀県', '長崎県', '熊本県', '大分県', '宮崎県',
      '鹿児島県', '沖縄県'
  ]
  EMPLOYMENT_TYPES =[
      "正社員",
      "契約社員",
      "アルバイト"
  ]
  OCCUPATION_TYPES = [
      "オープンポジション",
      "総合職",
      "事務関連",
      "営業・販売関連",
      "企画・マーケティング関連",
      "IT・エンジニア関連",
      "技術関連",
      "クリエイティブ関連",
      "専門職関連",
      "その他"
  ]


  EDUCATION_TYPES = [
      '高等学校',
      '養護学校',
      '各種専門学校',
      '短期学校',
      '四年生大学',
      '大学院',
      '高等専門学校',
      '中学校',
      '四年生大学中退',
      '大学院中退'
  ]

  SELECT_REQUIRES = [
      '不要',
      '必要',
      'あれば尚可'
  ]

  SELECT_SUPPORTS = [
      '対応不可',
      '対応可能',
      '一部対応可能'
  ]

end